/*
아스키코드 써서 대문자 소문자 변환
 a~z = 97~122
 A~z = 65~90
 스페이스바 = 32 
한 글자씩 배열에 할당(스페이스도 한 글자 취급 할 것) arr[3][27](스페이스 포함)  
*/
#include <stdio.h>

int main()
{
	char answer[] = {};	//사용자의 답을 받을 것
	char alphabet[27][2] = {
	{'a', 'A'}, {'b', 'B'}, {'c', 'C'}, {'d', 'D'}, {'e', 'E'}, {'f', 'F'},
	{'g', 'G'}, {'h', 'H'}, {'i', 'I'}, {'j', 'J'}, {'k', 'K'},
	{'l', 'L'}, {'m', 'M'}, {'n', 'N'}, {'o', 'O'}, {'p', 'P'},
	{'q', 'Q'}, {'r', 'R'}, {'s', 'S'}, {'t', 'T'}, {'u', 'U'},
	{'v', 'V'}, {'w', 'W'}, {'x', 'X'}, {'y', 'Y'}, {'z', 'Z'}, {' ', ' '}
	};  
	
	char str[27][6] = {	//모스부호 + 스페이스바 한 번씩 눌러진상태. 
	{".- "},{"-... "},{"-.-. "},{"-.. "},{". "},{"..-. "},		//abcdef
	{"--. "},{".... "},{".. "},{".--- "},{"-.- "},				//ghijk
	{".-.. "},{"-- "},{"-. "},{"--- "},{".--. "},				//lmnop
	{"--.- "},{".-. "},{"... "},{"- "},{"..- "},				//qrstu
	{"...- "},{".-- "},{"-..- "},{"-.-- "},{"--.. "},{" "}		//vwxyz+스페이스바  
	};
	
	printf("%s",alphabet);
	
 	return 0;
} 
 
